lsh0223/stm32websystem/stm32Project/USER/main.c
static void App_Task_1s(void)
{
    u8  human;
    u16 smoke_adc;
    u8  smoke_percent;
    float bal_f = 0.0f;

    // 重置逻辑
    if (esp8266_remote_reset_flag) {
        esp8266_remote_reset_flag = 0;
        
        App_InitContext(); 
        
        g_screen = SCREEN_WELCOME;
        g_confirm = CONFIRM_NONE;
        UI_DrawWelcomeStatic();
        
        ESP8266_Init_Async(); 
        
        UI_ShowServerMsg("系统已重置");
        g_server_msg_secs = 3; 
        
        return;                 
    }

    if (esp8266_remote_pc_on_flag) {
        esp8266_remote_pc_on_flag = 0;
        g_app.pc_on = 1; Seat_PC_Set(1);
        if (g_screen == SCREEN_INUSE) UI_UpdatePCButton();
        Netbar_Publish_SeatState();
    }
    if (esp8266_remote_pc_off_flag) {
        esp8266_remote_pc_off_flag = 0;
        g_app.pc_on = 0; Seat_PC_Set(0);
        if (g_screen == SCREEN_INUSE) UI_UpdatePCButton();
        Netbar_Publish_SeatState();
    }
    if (esp8266_remote_light_on_flag) {
        esp8266_remote_light_on_flag = 0;
        g_app.light_on = 1; Seat_Light_Set(1);
        if (g_screen == SCREEN_INUSE) UI_UpdateLightButton();
        Netbar_Publish_SeatState();
    }
    if (esp8266_remote_light_off_flag) {
        esp8266_remote_light_off_flag = 0;
        g_app.light_on = 0; Seat_Light_Set(0);
        if (g_screen == SCREEN_INUSE) UI_UpdateLightButton();
        Netbar_Publish_SeatState();
    }
    if (esp8266_remote_checkout_flag) {
        esp8266_remote_checkout_flag = 0;
        if (g_app.state == STATE_INUSE) {
            App_EndSession();       
        }
    }
    if (esp8266_remote_msg_flag) {
        esp8266_remote_msg_flag = 0;
        g_server_msg_secs       = 5;      
        UI_ShowServerMsg(esp8266_remote_msg);
    }
    if (esp8266_remote_maint_on_flag) {
        esp8266_remote_maint_on_flag = 0;
        g_app.maint_mode             = 1;
        if (g_screen == SCREEN_WELCOME) UI_DrawWelcomeStatic();
        UI_ShowServerMsg("座位已设为维护中");
        g_server_msg_secs = 5;
    }
    if (esp8266_remote_maint_off_flag) {
        esp8266_remote_maint_off_flag = 0;
        g_app.maint_mode              = 0;
        if (g_screen == SCREEN_WELCOME) UI_DrawWelcomeStatic();
        UI_ShowServerMsg("维护结束");
        g_server_msg_secs = 5;
    }

    if (esp8266_remote_card_ok_flag) {
        esp8266_remote_card_ok_flag = 0;
        g_wait_card_auth            = 0;

        g_app.used_seconds = esp8266_remote_restore_sec; 
        
        memset(g_app.user_name, 0, sizeof(g_app.user_name));
        strcpy((char*)g_app.user_name, esp8266_remote_user_name);
        sscanf(esp8266_remote_balance_str, "%f", &bal_f);
        g_app.balance = (u32)(bal_f * 100);

        if (g_app.state != STATE_INUSE) {
            g_app.state = STATE_INUSE;
            g_app.pc_on    = 1; g_app.light_on = 1;
            Seat_PC_Set(1); Seat_Light_Set(1);

            g_screen  = SCREEN_INUSE;
            g_confirm = CONFIRM_NONE;

            UI_DrawInuseStatic();
            UI_ShowServerMsg("刷卡成功，开始计费");
        } else {
             UI_ShowServerMsg("时间已与服务器同步");
        }
        
        UI_UpdateStateLine();
        UI_UpdateUserLine();
        UI_UpdateCardLine();
        UI_UpdateBalanceLine();
        UI_UpdateRuntimeAndFee();
        UI_UpdatePCButton();
        UI_UpdateLightButton();
        g_server_msg_secs = 3;
    }

    if (esp8266_remote_card_err_flag) {
        esp8266_remote_card_err_flag = 0;
        g_wait_card_auth             = 0;
        if (esp8266_card_err_msg[0] != 0) UI_ShowServerMsg(esp8266_card_err_msg);
        else UI_ShowServerMsg("刷卡失败");
        g_server_msg_secs = 5;
        g_app.has_user = 0;
        g_card_cooldown_tick = GetSysMs() + 3000;
    }

    if (g_wait_card_auth) {
        if (GetSysMs() - g_card_auth_tick >= 5000) {
            g_wait_card_auth = 0;
            UI_ShowServerMsg("验证超时，请重刷");
            g_server_msg_secs = 3;
            g_card_cooldown_tick = GetSysMs() + 3000;
        }
    }

    if (g_server_msg_secs > 0) {
        g_server_msg_secs--;
        if (g_server_msg_secs == 0) UI_ClearServerMsg();
    }

    if ((g_app.state == STATE_INUSE) && (g_screen == SCREEN_INUSE)) {
        g_app.used_seconds++;
        UI_UpdateRuntimeAndFee();   
    }

    human         = Seat_Radar_Get();
    smoke_adc     = Seat_Smoke_GetRaw();
    smoke_percent = Smoke_AdcToPercent(smoke_adc);

    if ((g_screen == SCREEN_WELCOME) && (g_app.state == STATE_IDLE) && (g_app.maint_mode == 0))
    {
        if (human) {
            if (g_idle_human_seconds < 0xFFFFFFFF) g_idle_human_seconds++;
            if ((g_idle_human_seconds >= 12) && (g_idle_occupy_alarm == 0)) {
                g_idle_occupy_alarm = 1;
                ESP8266_MQTT_Pub_Async("netbar/seat001/alert", "occupy_over_120s");
            }
        } else {
            g_idle_human_seconds = 0;
            g_idle_occupy_alarm  = 0;
        }
    } else {
        g_idle_human_seconds = 0;
        g_idle_occupy_alarm  = 0;
    }

    if (g_app.state == STATE_INUSE) {
        if (human) g_inuse_nohuman_seconds = 0;
        else {
            if (g_inuse_nohuman_seconds < 0xFFFFFFFF) g_inuse_nohuman_seconds++;
            if (g_inuse_nohuman_seconds >= 15 * 60) {
                ESP8266_MQTT_Pub_Async("netbar/seat001/alert", "auto_checkout_nohuman_15min");
                App_EndSession();
                g_inuse_nohuman_seconds = 0;
            }
        }
    } else {
        g_inuse_nohuman_seconds = 0;
    }

    if (g_screen == SCREEN_WELCOME) UI_UpdateEnvWelcome(human, smoke_percent);
    else UI_UpdateEnvInuse(human, smoke_percent);

    UI_UpdateWifiIcon();
}

static void App_InitContext(void)
{
    g_app.state        = STATE_IDLE;
    g_app.has_user     = 0;
    memset(g_app.uid, 0, 4);
    strcpy((char *)g_app.user_name, "--");
    g_app.balance      = 0;        
    g_app.used_seconds = 0;
    g_app.pc_on        = 0;
    g_app.light_on     = 0;
    g_app.maint_mode   = 0;        

    Seat_PC_Set(0);
    Seat_Light_Set(0);
    Seat_Buzzer_Set(0);

    g_idle_human_seconds    = 0;
    g_idle_occupy_alarm     = 0;
    g_inuse_nohuman_seconds = 0;
    g_wait_card_auth        = 0;
    g_server_msg_secs       = 0;
}

static void UI_DrawSplashScreen(void)
{
    LCD_Clear(BLUE);
    POINT_COLOR = WHITE;
    BACK_COLOR  = BLUE;
    
    Show_Str(30, 100, 240, 24, (u8 *)"智能无人网吧系统", 24, 0);
    Show_Str(80, 140, 200, 16, (u8 *)"System Init...", 16, 0);
    Show_Str(60, 280, 200, 16, (u8 *)"By: Student", 16, 0);
}

static void UI_DrawWelcomeStatic(void)
{
    LCD_Clear(WHITE);
    LCD_Fill(0, 0, lcddev.width - 1, 30, BLUE);
    POINT_COLOR = WHITE;
    BACK_COLOR  = BLUE;
    Show_Str(10, 5, lcddev.width - 90, 24, (u8 *)"智能无人网吧系统", 24, 0); 
    UI_UpdateWifiIcon();   
    POINT_COLOR = BLACK;
    BACK_COLOR  = WHITE;
    Show_Str(10, 40, lcddev.width - 20, 16, (u8 *)"欢迎使用", 16, 0);
    Show_Str(10, 60, lcddev.width - 20, 16, (u8 *)"费率: 1元/分钟(测试)", 16, 0);
    Show_Str(10, 90,  80, 16, (u8 *)"座位:", 16, 0);
    Show_Str(10, 110, 80, 16, (u8 *)"烟雾:", 16, 0);
    LCD_Fill(70, 90,  lcddev.width - 10, 106, WHITE);
    LCD_Fill(70, 110, lcddev.width - 10, 126, WHITE);
    LCD_Fill(10, 150, lcddev.width - 10, 190, GRAY);
    POINT_COLOR = BLUE;
    BACK_COLOR  = GRAY;
    if (g_app.maint_mode) Show_Str(20, 160, lcddev.width - 40, 16, (u8 *)"维护中，请勿上机", 16, 0);
    else Show_Str(20, 160, lcddev.width - 40, 16, (u8 *)"请刷卡上机", 16, 0);
    POINT_COLOR = BLACK;
    BACK_COLOR  = WHITE;
    Show_Str(10, 210, lcddev.width - 20, 16, (u8 *)"费率:1元/分钟", 16, 0);
    LCD_Fill(10, 230, lcddev.width - 10, 250, WHITE);
}

